//-------------------------------------------------------------------------------------
// Class : Cylinder
// 親Class   :   GameObject
// 
// Cylinderを表示するゲームオブジェクト
// 
// Yasuda.Aoto  2023.07.14
//-------------------------------------------------------------------------------------
#pragma once
//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "gameobject.h"
class Cylinder :
    public GameObject
{
private:
public:
    void GameObjInit() override;
};

