//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "field.h"
//-------------------------------------------------------
// オプション関係
#include "ShaderComponent.h"
#include "Polygon3D.h"
#include "ModelSetting.h"
//-----------------------------------------------------------------------------
//      初期化処理です.
//-----------------------------------------------------------------------------
void Field::GameObjInit()
{
	//-------------------------------------------------------
	// テクスチャ読み込み
	AddComponent<ShaderComponent>()->Load();
	AddComponent<Polygon3D>()->Init(-50, 0, 50, 100, 0, "asset\\texture\\field.jpg");
	// シェーダー機能設定追加
	AddComponent<ModelSetting>()->Init();
}