//-------------------------------------------------------------------------------------
// Class : Field
// 親Class   :   GameObject
// 
// Fieldを表示するゲームオブジェクト
// 
// Yasuda.Aoto  2023.07.14
//-------------------------------------------------------------------------------------
#pragma once
//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include	<d3d11.h>
#include	<SimpleMath.h>
#include	"gameObject.h"

class Field : public GameObject
{
private:
public:
	void GameObjInit();
};