//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "sky.h"
//-------------------------------------------------------
// オプション関係
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "modelRenderer.h"
#include "camera.h"
#include "ShaderComponent.h"

using namespace DirectX::SimpleMath;
//-----------------------------------------------------------------------------
//      初期化処理です.
//-----------------------------------------------------------------------------
void Sky::GameObjInit()
{
	// サイズ変更
	m_Scale = Vector3(100.0f, 100.0f, 100.0f);
	//-------------------------------------------------------
	// Model読み込み
	AddComponent<ShaderComponent>()->Load();
	AddComponent<ModelRenderer>()->Load("asset\\model\\sky\\sky.obj");
}
//-----------------------------------------------------------------------------
//      更新処理です.
//-----------------------------------------------------------------------------
void Sky::GameObjUpdate()
{
}
