//-------------------------------------------------------------------------------------
// Class : Sky
// 親Class   :   GameObject
// 
// Skyを表示するゲームオブジェクト
// 
// Yasuda.Aoto  2023.07.14
//-------------------------------------------------------------------------------------
#pragma once
//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include "gameObject.h"

class Sky : public GameObject
{

private:

public:
	void GameObjInit() override;
	void GameObjUpdate() override;
};